"""
http://pythontutor.ru/lessons/sets/problems/number_of_unique/
Дан список чисел. Определите, сколько в нем встречается различных чисел.
"""

print(len(set(input().split())))
