'''
http://pythontutor.ru/lessons/int_and_float/problems/last_digit/
Дано натуральное число. Выведите его последнюю цифру.
'''

num = int(input())

print(num%10)
