'''
http://pythontutor.ru/lessons/int_and_float/problems/fractional_part/
Дано положительное действительное число X. Выведите его дробную часть.
'''

num = float(input())

print(num % 1)
#print(num - int(x))
#print(num - num // 1)
