'''
http://pythontutor.ru/lessons/int_and_float/problems/hypot/
Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.
'''

a = int(input())
b = int(input())

print((a**2 + b**2) ** 0.5)
