'''
http://pythontutor.ru/lessons/str/problems/replace_substring/
Дана строка. Замените в этой строке все цифры 1 на слово one.
'''

s = input()

print(s.replace('1', 'one'))
