'''
http://pythontutor.ru/lessons/str/problems/delete_char/
Дана строка. Удалите из этой строки все символы @.
'''

s = input()

print(s.replace('@', ''))
